package lessons.lessons005.home.work;


// Условия для выбора квартиры
// В программе хранится информация о 4 квартирах, каждая квартира это набор из 3 переменных (цена, количество комнат(1-5), этаж (1-9))
// Данные квартиры вбей в программу сам, как захочешь
// Для каждый квартиры нужно проверить условия и написать соответсвует она условиям или нет
// 1) Квартира между 5 и 9 этажом и обязательно 2-комнатная
// 2) Стоимость квартиры от 1000_000 до 3000_000 и квартира не на первом этаже
// 3) Количество комнат больше 3 или стоимость квартиры меньше 1000_000
public class LogicHomeWork2 {
}
