package lessons.lesson002.home.work;

//Домашние упражнения на печать в консоль
//1.    Напечатать свое любимое четверостишье
//      Каждая строчка должна быть с новой строки
//      Снизу подписать автора.
//      Можешь сделать Красивый заголовок, на подобие этого:
//      ****************** Четверостишье *****************

// *** Доп. задание, написать тоже четвер. только черз System.err, а не через System.out

public class PrintWork {

    public static void main(String[] args) {

        System.err.println("########################Четверостишье####################");
        System.err.println("#\tВсю жизнь мы теряем кого-то –\t\t\t\t\t\t#");
        System.err.println("#\tКто раньше уходит, кто позже\t\t\t\t\t\t#");
        System.err.println("#\tИх нет. И остались пустоты –\t\t\t\t\t\t#");
        System.err.println("#\tНе дай Бог от тех, кто моложе.\t\t\t\t\t\t#");
        System.err.println("#\tЛев Зазерский\t\t\t\t\t\t\t\t\t\t#");
        System.err.println("##########################################################");


    }

}
