package lessons.lesson002.home.work;

//Домашние упражнения на печать в консоль
//2.    Вывести Таблицу(содержимое можешь придумать сам), испульзуя табуляцию
//      У таблици должен быть заголовок и записи несколько строчек(строчки в таблице)
//      Пример :
//      Номер   |   Работник    |   Зарплата    |
//      1       |   Денис       |   2500        |
//      2       |   Николай     |   4000        |

public class PrintWork2 {

    public static void main(String[] args) {

        System.out.println("\tNumber\t**\tHuman\t**\tRank\t**");
        System.out.println("\t1\t\t**\tDerain\t**\tSoldier\t**");
        System.out.println("\t2\t\t**\tMari\t**\tLieutenant\t**");
        System.out.println("\t3\t\t**\tMaider\t**\tGeneral\t**");
        System.out.println("\t4\t\t**\tWold\t**\tColonel\t**");
        System.out.println("\t5\t\t**\tbill\t**\tCaptain\t**");
        System.out.println("\t6\t\t**\tJohn\t**\tOfficer\t**");

    }

}
