package lessons.lesson002.home.work;

//Домашние упражнения на печать в консоль
//1.    Напечатать свое любимое четверостишье
//      Каждая строчка должна быть с новой строки
//      Снизу подписать автора.
//      Можешь сделать Красивый заголовок, на подобие этого:
//      ****************** Четверостишье *****************

// *** Доп. задание, написать тоже четвер. только черз System.err, а не через System.out

public class PrintWork {

    public static void main(String[] args) {

        //Писать тут:


    }

}
