package lessons.lesson002.home.work;

//Домашние упражнения на печать в консоль
//2.    Вывести Таблицу(содержимое можешь придумать сам), испульзуя табуляцию
//      У таблици должен быть заголовок и записи несколько строчек(строчки в таблице)
//      Пример :
//      Номер   |   Работник    |   Зарплата    |
//      1       |   Денис       |   2500        |
//      2       |   Николай     |   4000        |

public class PrintWork2 {

    public static void main(String[] args) {

        //Писать тут


    }

}
