package lessons.lessons007.home.work;

// Игра казино-автомат
// У пользователя 1000 рублей
// Пользователю предлагается сделать ход, он должен выбрать Y или N
// Стоимость хода 5 рублей
// Генерируется рандомное число от 100 до 999
// Если число состоит из одинаковых цифр : 111,222,333,444,555,666,...,999 - польхователь выигрывает 100 рублей
// Если 777 - 500 рублей
// Если в числе последняя цифра 5, он выигрывает 20 рублей(чтобы узнать посл. цифру чимсла можно разделить с остатком на 10 : 234 % 10 = 4)
// Иначе он проиграл
public class LoopHW6 {
}
