package lessons.lessons003.home.work;

//Найти путь пройденный косм. короблем
//Пользователь вводит скорость коробля (км/сек)
//вводит время в пути в днях
//Напечатать сколько метров было преодалено короблем

//**** Внимание : величины имеют разные системы измерения(их нужно превести друг к другу)
//**** Могут получаться большие числа

import java.util.Scanner;

public class IntegerWork3 {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Киломентры в секунду");
        long speed ;
        System.out.println("Пройденные дни");
        long day;

    }

}
