package lessons.lessons006.home.work;

//Написать программу онлайн-библиотека
//Пользователю показывается список стихотворений
//Пример
//1. Пушкин. Гусар
//2. Пушкин. Возрождение
//3. Есенин. Письмо матери
// и.т.д
//Список стихотворений может быть любым
//Сайт стихов http://www.100bestpoems.ru/
//Пользователь вводит цифру стихотворение и цифра правильная ему показывается отрывок стихотворения
//Если цифра не правильная. Написать что пользователь ошибся
//Сделать через switch
public class SwitchWork4 {
}
